sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_hci_le.c
  for (int i = 0; i < sizeof( cp0->Scanning_PHYs)*8; i++) {
    if((cp0->Scanning_PHYs >> i) & 0x01){
      len++;
    }
  }
  /* var_len_data input */
  {
    for (int i = 0; i < len; i++) {
      packed_Extended_Scan_Parameters_t *Extended_Scan_Parameters_tmp = (packed_Extended_Scan_Parameters_t *)(((uint8_t *)cmd_buffer) + index_input);
      Extended_Scan_Parameters_tmp->Scan_Type = Extended_Scan_Parameters[i].Scan_Type;
      index_input += 1;
      Extended_Scan_Parameters_tmp->Scan_Interval = Extended_Scan_Parameters[i].Scan_Interval;
      index_input += 2;
      Extended_Scan_Parameters_tmp->Scan_Window = Extended_Scan_Parameters[i].Scan_Window;
      index_input += 2;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x041;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_extended_scan_enable(uint8_t Enable,
                                           uint8_t Filter_Duplicates,
                                           uint16_t Duration,
                                           uint16_t Period)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_scan_enable_cp0 *cp0 = (hci_le_set_extended_scan_enable_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  cp0->Filter_Duplicates = htob(Filter_Duplicates, 1);
  index_input += 1;
  cp0->Duration = htob(Duration, 2);
  index_input += 2;
  cp0->Period = htob(Period, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x042;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_extended_create_connection(uint8_t Initiator_Filter_Policy,
                                             uint8_t Own_Address_Type,
                                             uint8_t Peer_Address_Type,
                                             uint8_t Peer_Address[6],
                                             uint8_t Initiating_PHYs,
                                             Extended_Create_Connection_Parameters_t Extended_Create_Connection_Parameters[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_extended_create_connection_cp0 *cp0 = (hci_le_extended_create_connection_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Initiator_Filter_Policy = htob(Initiator_Filter_Policy, 1);
  index_input += 1;
  cp0->Own_Address_Type = htob(Own_Address_Type, 1);
  index_input += 1;
  cp0->Peer_Address_Type = htob(Peer_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Address, (const void *) Peer_Address, 6);
  index_input += 6;
  cp0->Initiating_PHYs = htob(Initiating_PHYs, 1);
  index_input += 1;
  int len = 0;

  for (int i = 0; i < sizeof( cp0->Initiating_PHYs)*8; i++) {
    if((cp0->Initiating_PHYs >> i) & 0x01){
      len++;
    }
  }
  /* var_len_data input */
  {
    for (int i = 0; i < len; i++) {
      packed_Extended_Create_Connection_Parameters_t *Extended_Create_Connection_Parameters_tmp = (packed_Extended_Create_Connection_Parameters_t *)(((uint8_t *)cmd_buffer) + index_input);
      Extended_Create_Connection_Parameters_tmp->Scan_Interval = Extended_Create_Connection_Parameters[i].Scan_Interval;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Scan_Window = Extended_Create_Connection_Parameters[i].Scan_Window;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Connection_Interval_Min = Extended_Create_Connection_Parameters[i].Connection_Interval_Min;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Connection_Interval_Max = Extended_Create_Connection_Parameters[i].Connection_Interval_Max;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Max_Latency = Extended_Create_Connection_Parameters[i].Max_Latency;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Supervision_Timeout = Extended_Create_Connection_Parameters[i].Supervision_Timeout;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Min_CE_Length = Extended_Create_Connection_Parameters[i].Min_CE_Length;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Max_CE_Length = Extended_Create_Connection_Parameters[i].Max_CE_Length;
      index_input += 2;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x043;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_periodic_advertising_create_sync(uint8_t Options,
                                                   uint8_t Advertising_SID,
                                                   uint8_t Advertiser_Address_Type,
                                                   uint8_t Advertiser_Address[6],
                                                   uint16_t Skip,
                                                   uint16_t Sync_Timeout,
                                                   uint8_t Sync_CTE_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_create_sync_cp0 *cp0 = (hci_le_periodic_advertising_create_sync_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Options = htob(Options, 1);
  index_input += 1;
  cp0->Advertising_SID = htob(Advertising_SID, 1);
  index_input += 1;
  cp0->Advertiser_Address_Type = htob(Advertiser_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Advertiser_Address, (const void *) Advertiser_Address, 6);
  index_input += 6;
  cp0->Skip = htob(Skip, 2);
  index_input += 2;
  cp0->Sync_Timeout = htob(Sync_Timeout, 2);
  index_input += 2;
  cp0->Sync_CTE_Type = htob(Sync_CTE_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x044;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_periodic_advertising_create_sync_cancel(void)
{
  struct hci_request rq;
  tBleStatus status = 0;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x045;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_periodic_advertising_terminate_sync(uint16_t Sync_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_terminate_sync_cp0 *cp0 = (hci_le_periodic_advertising_terminate_sync_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x046;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_add_device_to_periodic_advertiser_list(uint8_t Advertiser_Address_Type,
                                                         uint8_t Advertiser_Address[6],
                                                         uint8_t Advertising_SID)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_add_device_to_periodic_advertiser_list_cp0 *cp0 = (hci_le_add_device_to_periodic_advertiser_list_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertiser_Address_Type = htob(Advertiser_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Advertiser_Address, (const void *) Advertiser_Address, 6);
  index_input += 6;
  cp0->Advertising_SID = htob(Advertising_SID, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x047;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_remove_device_from_periodic_advertiser_list(uint8_t Advertiser_Address_Type,
                                                              uint8_t Advertiser_Address[6],
                                                              uint8_t Advertising_SID)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_remove_device_from_periodic_advertiser_list_cp0 *cp0 = (hci_le_remove_device_from_periodic_advertiser_list_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertiser_Address_Type = htob(Advertiser_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Advertiser_Address, (const void *) Advertiser_Address, 6);
  index_input += 6;
  cp0->Advertising_SID = htob(Advertising_SID, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x048;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_clear_periodic_advertiser_list(void)
{
  struct hci_request rq;
  tBleStatus status = 0;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x049;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_periodic_advertiser_list_size(uint8_t *Periodic_Advertiser_List_Size)
{
  struct hci_request rq;
  hci_le_read_periodic_advertiser_list_size_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04a;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Periodic_Advertiser_List_Size = btoh(resp.Periodic_Advertiser_List_Size, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_transmit_power(int8_t *Min_Tx_Power,
                                      int8_t *Max_Tx_Power)
{
  struct hci_request rq;
  hci_le_read_transmit_power_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04b;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Min_Tx_Power = btoh(resp.Min_Tx_Power, 1);
  *Max_Tx_Power = btoh(resp.Max_Tx_Power, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_rf_path_compensation(int16_t *RF_TX_Path_Compensation_Value,
                                            int16_t *RF_RX_Path_Compensation_Value)
{
  struct hci_request rq;
  hci_le_read_rf_path_compensation_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04c;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *RF_TX_Path_Compensation_Value = btoh(resp.RF_TX_Path_Compensation_Value, 2);
  *RF_RX_Path_Compensation_Value = btoh(resp.RF_RX_Path_Compensation_Value, 2);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_write_rf_path_compensation(int16_t RF_TX_Path_Compensation_Value,
                                             int16_t RF_RX_Path_Compensation_Value)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_write_rf_path_compensation_cp0 *cp0 = (hci_le_write_rf_path_compensation_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->RF_TX_Path_Compensation_Value = htob(RF_TX_Path_Compensation_Value, 2);
  index_input += 2;
  cp0->RF_RX_Path_Compensation_Value = htob(RF_RX_Path_Compensation_Value, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04d;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_privacy_mode(uint8_t Peer_Identity_Address_Type,
                                   uint8_t Peer_Identity_Address[6],
                                   uint8_t Privacy_Mode)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_privacy_mode_cp0 *cp0 = (hci_le_set_privacy_mode_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Peer_Identity_Address_Type = htob(Peer_Identity_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Identity_Address, (const void *) Peer_Identity_Address, 6);
  index_input += 6;
  cp0->Privacy_Mode = htob(Privacy_Mode, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04e;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_receiver_test_v3(uint8_t RX_Channel,
                                   uint8_t PHY,
                                   uint8_t Modulation_Index,
                                   uint8_t Expected_CTE_Length,
                                   uint8_t Expected_CTE_Type,
                                   uint8_t Slot_Durations,
                                   uint8_t Switching_Pattern_Length,
                                   uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_receiver_test_v3_cp0 *cp0 = (hci_le_receiver_test_v3_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->RX_Channel = htob(RX_Channel, 1);
  index_input += 1;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  cp0->Modulation_Index = htob(Modulation_Index, 1);
  index_input += 1;
  cp0->Expected_CTE_Length = htob(Expected_CTE_Length, 1);
  index_input += 1;
  cp0->Expected_CTE_Type = htob(Expected_CTE_Type, 1);
  index_input += 1;
  cp0->Slot_Durations = htob(Slot_Durations, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x04f;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_transmitter_test_v3(uint8_t TX_Channel,
                                      uint8_t Test_Data_Length,
                                      uint8_t Packet_Payload,
                                      uint8_t PHY,
                                      uint8_t CTE_Length,
                                      uint8_t CTE_Type,
                                      uint8_t Switching_Pattern_Length,
                                      uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_transmitter_test_v3_cp0 *cp0 = (hci_le_transmitter_test_v3_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->TX_Channel = htob(TX_Channel, 1);
  index_input += 1;
  cp0->Test_Data_Length = htob(Test_Data_Length, 1);
  index_input += 1;
  cp0->Packet_Payload = htob(Packet_Payload, 1);
  index_input += 1;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  cp0->CTE_Length = htob(CTE_Length, 1);
  index_input += 1;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x050;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_connectionless_cte_transmit_parameters(uint8_t Advertising_Handle,
                                                             uint8_t CTE_Length,
                                                             uint8_t CTE_Type,
                                                             uint8_t CTE_Count,
                                                             uint8_t Switching_Pattern_Length,
                                                             uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_connectionless_cte_transmit_parameters_cp0 *cp0 = (hci_le_set_connectionless_cte_transmit_parameters_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->CTE_Length = htob(CTE_Length, 1);
  index_input += 1;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  cp0->CTE_Count = htob(CTE_Count, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x051;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_connectionless_cte_transmit_enable(uint8_t Advertising_Handle,
                                                         uint8_t CTE_Enable)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_connectionless_cte_transmit_enable_cp0 *cp0 = (hci_le_set_connectionless_cte_transmit_enable_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->CTE_Enable = htob(CTE_Enable, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x052;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_connectionless_iq_sampling_enable(uint16_t Sync_Handle,
                                                        uint8_t Sampling_Enable,
                                                        uint8_t Slot_Durations,
                                                        uint8_t Max_Sampled_CTEs,
                                                        uint8_t Switching_Pattern_Length,
                                                        uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_connectionless_iq_sampling_enable_cp0 *cp0 = (hci_le_set_connectionless_iq_sampling_enable_cp0*)(cmd_buffer);
  hci_le_set_connectionless_iq_sampling_enable_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  cp0->Sampling_Enable = htob(Sampling_Enable, 1);
  index_input += 1;
  cp0->Slot_Durations = htob(Slot_Durations, 1);
  index_input += 1;
  cp0->Max_Sampled_CTEs = htob(Max_Sampled_CTEs, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x053;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_connection_cte_receive_parameters(uint16_t Connection_Handle,
                                                        uint8_t Sampling_Enable,
                                                        uint8_t Slot_Durations,
                                                        uint8_t Switching_Pattern_Length,
                                                        uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_connection_cte_receive_parameters_cp0 *cp0 = (hci_le_set_connection_cte_receive_parameters_cp0*)(cmd_buffer);
  hci_le_set_connection_cte_receive_parameters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Sampling_Enable = htob(Sampling_Enable, 1);
  index_input += 1;
  cp0->Slot_Durations = htob(Slot_Durations, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x054;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_connection_cte_transmit_parameters(uint16_t Connection_Handle,
                                                         uint8_t CTE_Type,
                                                         uint8_t Switching_Pattern_Length,
                                                         uint8_t Antenna_IDs[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_connection_cte_transmit_parameters_cp0 *cp0 = (hci_le_set_connection_cte_transmit_parameters_cp0*)(cmd_buffer);
  hci_le_set_connection_cte_transmit_parameters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x055;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
