sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_hci_le.c
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_connection_cte_request_enable(uint16_t Connection_Handle,
                                                uint8_t Enable,
                                                uint16_t CTE_Request_Interval,
                                                uint8_t Requested_CTE_Length,
                                                uint8_t Requested_CTE_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_connection_cte_request_enable_cp0 *cp0 = (hci_le_connection_cte_request_enable_cp0*)(cmd_buffer);
  hci_le_connection_cte_request_enable_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  cp0->CTE_Request_Interval = htob(CTE_Request_Interval, 2);
  index_input += 2;
  cp0->Requested_CTE_Length = htob(Requested_CTE_Length, 1);
  index_input += 1;
  cp0->Requested_CTE_Type = htob(Requested_CTE_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x056;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_connection_cte_response_enable(uint16_t Connection_Handle,
                                                 uint8_t Enable)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_connection_cte_response_enable_cp0 *cp0 = (hci_le_connection_cte_response_enable_cp0*)(cmd_buffer);
  hci_le_connection_cte_response_enable_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x057;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_antenna_information(uint8_t *Supported_Switching_Sampling_Rates,
                                           uint8_t *Num_Antennae,
                                           uint8_t *Max_Switching_Pattern_Length,
                                           uint8_t *Max_CTE_Length)
{
  struct hci_request rq;
  hci_le_read_antenna_information_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x058;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Supported_Switching_Sampling_Rates = btoh(resp.Supported_Switching_Sampling_Rates, 1);
  *Num_Antennae = btoh(resp.Num_Antennae, 1);
  *Max_Switching_Pattern_Length = btoh(resp.Max_Switching_Pattern_Length, 1);
  *Max_CTE_Length = btoh(resp.Max_CTE_Length, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_advertising_receive_enable(uint16_t Sync_Handle,
                                                          uint8_t Enable)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_receive_enable_cp0 *cp0 = (hci_le_set_periodic_advertising_receive_enable_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x059;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_periodic_advertising_sync_transfer(uint16_t Connection_Handle,
                                                     uint16_t Service_Data,
                                                     uint16_t Sync_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_sync_transfer_cp0 *cp0 = (hci_le_periodic_advertising_sync_transfer_cp0*)(cmd_buffer);
  hci_le_periodic_advertising_sync_transfer_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Service_Data = htob(Service_Data, 2);
  index_input += 2;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x05a;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_periodic_advertising_set_info_transfer(uint16_t Connection_Handle,
                                                         uint16_t Service_Data,
                                                         uint8_t Advertising_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_periodic_advertising_set_info_transfer_cp0 *cp0 = (hci_le_periodic_advertising_set_info_transfer_cp0*)(cmd_buffer);
  hci_le_periodic_advertising_set_info_transfer_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Service_Data = htob(Service_Data, 2);
  index_input += 2;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x05b;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_advertising_sync_transfer_parameters(uint16_t Connection_Handle,
                                                                    uint8_t Mode,
                                                                    uint16_t Skip,
                                                                    uint16_t Sync_Timeout,
                                                                    uint8_t CTE_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_sync_transfer_parameters_cp0 *cp0 = (hci_le_set_periodic_advertising_sync_transfer_parameters_cp0*)(cmd_buffer);
  hci_le_set_periodic_advertising_sync_transfer_parameters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Mode = htob(Mode, 1);
  index_input += 1;
  cp0->Skip = htob(Skip, 2);
  index_input += 2;
  cp0->Sync_Timeout = htob(Sync_Timeout, 2);
  index_input += 2;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x05c;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_default_periodic_advertising_sync_transfer_parameters(uint8_t Mode,
                                                                            uint16_t Skip,
                                                                            uint16_t Sync_Timeout,
                                                                            uint8_t CTE_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0 *cp0 = (hci_le_set_default_periodic_advertising_sync_transfer_parameters_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Mode = htob(Mode, 1);
  index_input += 1;
  cp0->Skip = htob(Skip, 2);
  index_input += 2;
  cp0->Sync_Timeout = htob(Sync_Timeout, 2);
  index_input += 2;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x05d;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_buffer_size_v2(uint16_t *HC_LE_ACL_Data_Packet_Length,
                                      uint8_t *HC_Total_Num_LE_ACL_Data_Packets,
                                      uint16_t *ISO_Data_Packet_Length,
                                      uint8_t *Total_Num_ISO_Data_Packets)
{
  struct hci_request rq;
  hci_le_read_buffer_size_v2_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x060;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *HC_LE_ACL_Data_Packet_Length = btoh(resp.HC_LE_ACL_Data_Packet_Length, 2);
  *HC_Total_Num_LE_ACL_Data_Packets = btoh(resp.HC_Total_Num_LE_ACL_Data_Packets, 1);
  *ISO_Data_Packet_Length = btoh(resp.ISO_Data_Packet_Length, 2);
  *Total_Num_ISO_Data_Packets = btoh(resp.Total_Num_ISO_Data_Packets, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_iso_tx_sync(uint16_t Connection_Handle,
                                   uint16_t *Packet_Sequence_Number,
                                   uint32_t *TX_Time_Stamp,
                                   uint8_t Time_Offset[3])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_read_iso_tx_sync_cp0 *cp0 = (hci_le_read_iso_tx_sync_cp0*)(cmd_buffer);
  hci_le_read_iso_tx_sync_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x061;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Packet_Sequence_Number = btoh(resp.Packet_Sequence_Number, 2);
  *TX_Time_Stamp = btoh(resp.TX_Time_Stamp, 4);
  STM32WB_memcpy((void *) Time_Offset, (const void *) resp.Time_Offset, 3);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_cig_parameters(uint8_t CIG_ID,
                                     uint8_t SDU_Interval_C_To_P[3],
                                     uint8_t SDU_Interval_P_To_C[3],
                                     uint8_t Worst_Case_SCA,
                                     uint8_t Packing,
                                     uint8_t Framing,
                                     uint16_t Max_Transport_Latency_C_To_P,
                                     uint16_t Max_Transport_Latency_P_To_C,
                                     uint8_t CIS_Count,
                                     CIS_Param_t CIS_Param[],
                                     uint16_t Connection_Handle[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_cig_parameters_cp0 *cp0 = (hci_le_set_cig_parameters_cp0*)(cmd_buffer);
  hci_le_set_cig_parameters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->CIG_ID = htob(CIG_ID, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->SDU_Interval_C_To_P, (const void *) SDU_Interval_C_To_P, 3);
  index_input += 3;
  STM32WB_memcpy((void *) &cp0->SDU_Interval_P_To_C, (const void *) SDU_Interval_P_To_C, 3);
  index_input += 3;
  cp0->Worst_Case_SCA = htob(Worst_Case_SCA, 1);
  index_input += 1;
  cp0->Packing = htob(Packing, 1);
  index_input += 1;
  cp0->Framing = htob(Framing, 1);
  index_input += 1;
  cp0->Max_Transport_Latency_C_To_P = htob(Max_Transport_Latency_C_To_P, 2);
  index_input += 2;
  cp0->Max_Transport_Latency_P_To_C = htob(Max_Transport_Latency_P_To_C, 2);
  index_input += 2;
  cp0->CIS_Count = htob(CIS_Count, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < CIS_Count; i++) {
      packed_CIS_Param_t *CIS_Param_tmp = (packed_CIS_Param_t *)(((uint8_t *)cmd_buffer) + index_input);
      CIS_Param_tmp->CIS_ID = CIS_Param[i].CIS_ID;
      index_input += 1;
      CIS_Param_tmp->Max_SDU_C_To_P = CIS_Param[i].Max_SDU_C_To_P;
      index_input += 2;
      CIS_Param_tmp->Max_SDU_P_To_C = CIS_Param[i].Max_SDU_P_To_C;
      index_input += 2;
      CIS_Param_tmp->PHY_C_To_P = CIS_Param[i].PHY_C_To_P;
      index_input += 1;
      CIS_Param_tmp->PHY_P_To_C = CIS_Param[i].PHY_P_To_C;
      index_input += 1;
      CIS_Param_tmp->RTN_C_To_P = CIS_Param[i].RTN_C_To_P;
      index_input += 1;
      CIS_Param_tmp->RTN_P_To_C = CIS_Param[i].RTN_P_To_C;
      index_input += 1;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x062;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  STM32WB_memcpy((void *) Connection_Handle, (const void *) resp.Connection_Handle, CIS_Count*sizeof(uint16_t));
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_cig_parameters_test(uint8_t CIG_ID,
                                          uint8_t SDU_Interval_C_To_P[3],
                                          uint8_t SDU_Interval_P_To_C[3],
                                          uint8_t FT_C_To_P,
                                          uint8_t FT_P_To_C,
                                          uint16_t ISO_Interval,
                                          uint8_t Worst_Case_SCA,
                                          uint8_t Packing,
                                          uint8_t Framing,
                                          uint8_t CIS_Count,
                                          CIS_Param_Test_t CIS_Param_Test[],
                                          uint16_t Connection_Handle[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_cig_parameters_test_cp0 *cp0 = (hci_le_set_cig_parameters_test_cp0*)(cmd_buffer);
  hci_le_set_cig_parameters_test_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->CIG_ID = htob(CIG_ID, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->SDU_Interval_C_To_P, (const void *) SDU_Interval_C_To_P, 3);
  index_input += 3;
  STM32WB_memcpy((void *) &cp0->SDU_Interval_P_To_C, (const void *) SDU_Interval_P_To_C, 3);
  index_input += 3;
  cp0->FT_C_To_P = htob(FT_C_To_P, 1);
  index_input += 1;
  cp0->FT_P_To_C = htob(FT_P_To_C, 1);
  index_input += 1;
  cp0->ISO_Interval = htob(ISO_Interval, 2);
  index_input += 2;
  cp0->Worst_Case_SCA = htob(Worst_Case_SCA, 1);
  index_input += 1;
  cp0->Packing = htob(Packing, 1);
  index_input += 1;
  cp0->Framing = htob(Framing, 1);
  index_input += 1;
  cp0->CIS_Count = htob(CIS_Count, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < CIS_Count; i++) {
      packed_CIS_Param_Test_t *CIS_Param_Test_tmp = (packed_CIS_Param_Test_t *)(((uint8_t *)cmd_buffer) + index_input);
      CIS_Param_Test_tmp->CIS_ID = CIS_Param_Test[i].CIS_ID;
      index_input += 1;
      CIS_Param_Test_tmp->NSE = CIS_Param_Test[i].NSE;
      index_input += 1;
      CIS_Param_Test_tmp->Max_SDU_C_To_P = CIS_Param_Test[i].Max_SDU_C_To_P;
      index_input += 2;
      CIS_Param_Test_tmp->Max_SDU_P_To_C = CIS_Param_Test[i].Max_SDU_P_To_C;
      index_input += 2;
      CIS_Param_Test_tmp->Max_PDU_C_To_P = CIS_Param_Test[i].Max_PDU_C_To_P;
      index_input += 2;
      CIS_Param_Test_tmp->Max_PDU_P_To_C = CIS_Param_Test[i].Max_PDU_P_To_C;
      index_input += 2;
      CIS_Param_Test_tmp->PHY_C_To_P = CIS_Param_Test[i].PHY_C_To_P;
      index_input += 1;
      CIS_Param_Test_tmp->PHY_P_To_C = CIS_Param_Test[i].PHY_P_To_C;
      index_input += 1;
      CIS_Param_Test_tmp->BN_C_To_P = CIS_Param_Test[i].BN_C_To_P;
      index_input += 1;
      CIS_Param_Test_tmp->BN_P_To_C = CIS_Param_Test[i].BN_P_To_C;
      index_input += 1;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x063;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  STM32WB_memcpy((void *) Connection_Handle, (const void *) resp.Connection_Handle, CIS_Count*sizeof(uint16_t));
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_create_cis(uint8_t CIS_Count,
                             CIS_Handles_t CIS_Handles[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_create_cis_cp0 *cp0 = (hci_le_create_cis_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->CIS_Count = htob(CIS_Count, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < CIS_Count; i++) {
      packed_CIS_Handles_t *CIS_Handles_tmp = (packed_CIS_Handles_t *)(((uint8_t *)cmd_buffer) + index_input);
      CIS_Handles_tmp->CIS_Connection_Handle = CIS_Handles[i].CIS_Connection_Handle;
      index_input += 2;
      CIS_Handles_tmp->ACL_Connection_Handle = CIS_Handles[i].ACL_Connection_Handle;
      index_input += 2;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x064;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_remove_cig(uint8_t CIG_ID)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_remove_cig_cp0 *cp0 = (hci_le_remove_cig_cp0*)(cmd_buffer);
  hci_le_remove_cig_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->CIG_ID = htob(CIG_ID, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x065;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_accept_cis_request(uint16_t Connection_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_accept_cis_request_cp0 *cp0 = (hci_le_accept_cis_request_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x066;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_reject_cis_request(uint16_t Connection_Handle,
                                     uint8_t Reason)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_reject_cis_request_cp0 *cp0 = (hci_le_reject_cis_request_cp0*)(cmd_buffer);
  hci_le_reject_cis_request_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Reason = htob(Reason, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x067;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_create_big(uint8_t BIG_Handle,
                             uint8_t Advertising_Handle,
                             uint8_t Num_BIS,
                             uint8_t SDU_Interval[3],
                             uint16_t Max_SDU,
                             uint16_t Max_Transport_Latency,
                             uint8_t RTN,
                             uint8_t PHY,
                             uint8_t Packing,
                             uint8_t Framing,
                             uint8_t Encryption,
                             uint8_t Broadcast_Code[16])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_create_big_cp0 *cp0 = (hci_le_create_big_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->BIG_Handle = htob(BIG_Handle, 1);
  index_input += 1;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Num_BIS = htob(Num_BIS, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->SDU_Interval, (const void *) SDU_Interval, 3);
  index_input += 3;
  cp0->Max_SDU = htob(Max_SDU, 2);
  index_input += 2;
  cp0->Max_Transport_Latency = htob(Max_Transport_Latency, 2);
  index_input += 2;
  cp0->RTN = htob(RTN, 1);
  index_input += 1;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  cp0->Packing = htob(Packing, 1);
  index_input += 1;
  cp0->Framing = htob(Framing, 1);
  index_input += 1;
  cp0->Encryption = htob(Encryption, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Broadcast_Code, (const void *) Broadcast_Code, 16);
  index_input += 16;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x068;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_create_big_test(uint8_t BIG_Handle,
                                  uint8_t Advertising_Handle,
                                  uint8_t Num_BIS,
                                  uint8_t SDU_Interval[3],
                                  uint16_t ISO_Interval,
                                  uint8_t NSE,
                                  uint16_t Max_SDU,
                                  uint16_t Max_PDU,
                                  uint8_t PHY,
                                  uint8_t Packing,
                                  uint8_t Framing,
                                  uint8_t BN,
                                  uint8_t IRC,
                                  uint8_t PTO,
                                  uint8_t Encryption,
                                  uint8_t Broadcast_Code[16])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_create_big_test_cp0 *cp0 = (hci_le_create_big_test_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->BIG_Handle = htob(BIG_Handle, 1);
  index_input += 1;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Num_BIS = htob(Num_BIS, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->SDU_Interval, (const void *) SDU_Interval, 3);
  index_input += 3;
  cp0->ISO_Interval = htob(ISO_Interval, 2);
  index_input += 2;
  cp0->NSE = htob(NSE, 1);
  index_input += 1;
  cp0->Max_SDU = htob(Max_SDU, 2);
  index_input += 2;
  cp0->Max_PDU = htob(Max_PDU, 2);
  index_input += 2;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  cp0->Packing = htob(Packing, 1);
  index_input += 1;
  cp0->Framing = htob(Framing, 1);
  index_input += 1;
  cp0->BN = htob(BN, 1);
  index_input += 1;
  cp0->IRC = htob(IRC, 1);
  index_input += 1;
  cp0->PTO = htob(PTO, 1);
  index_input += 1;
