sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_hci_le.c
  cp0->Encryption = htob(Encryption, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Broadcast_Code, (const void *) Broadcast_Code, 16);
  index_input += 16;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x069;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_terminate_big(uint8_t BIG_Handle,
                                uint8_t Reason)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_terminate_big_cp0 *cp0 = (hci_le_terminate_big_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->BIG_Handle = htob(BIG_Handle, 1);
  index_input += 1;
  cp0->Reason = htob(Reason, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06a;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_big_create_sync(uint8_t BIG_Handle,
                                  uint16_t Sync_Handle,
                                  uint8_t Encryption,
                                  uint8_t Broadcast_Code[16],
                                  uint8_t MSE,
                                  uint16_t BIG_Sync_Timeout,
                                  uint8_t Num_BIS,
                                  uint8_t BIS[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_big_create_sync_cp0 *cp0 = (hci_le_big_create_sync_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->BIG_Handle = htob(BIG_Handle, 1);
  index_input += 1;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  cp0->Encryption = htob(Encryption, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Broadcast_Code, (const void *) Broadcast_Code, 16);
  index_input += 16;
  cp0->MSE = htob(MSE, 1);
  index_input += 1;
  cp0->BIG_Sync_Timeout = htob(BIG_Sync_Timeout, 2);
  index_input += 2;
  cp0->Num_BIS = htob(Num_BIS, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->BIS, (const void *) BIS, Num_BIS*sizeof(uint8_t));
    index_input += Num_BIS*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06b;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_big_terminate_sync(uint8_t BIG_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_big_terminate_sync_cp0 *cp0 = (hci_le_big_terminate_sync_cp0*)(cmd_buffer);
  hci_le_big_terminate_sync_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->BIG_Handle = htob(BIG_Handle, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06c;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_request_peer_sca(uint16_t Connection_Handle)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_request_peer_sca_cp0 *cp0 = (hci_le_request_peer_sca_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06d;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_setup_iso_data_path(uint16_t Connection_Handle,
                                      uint8_t Data_Path_Direction,
                                      uint8_t Data_Path_ID,
                                      uint8_t Codec_ID[5],
                                      uint8_t Controller_Delay[3],
                                      uint8_t Codec_Configuration_Length,
                                      uint8_t Codec_Configuration[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_setup_iso_data_path_cp0 *cp0 = (hci_le_setup_iso_data_path_cp0*)(cmd_buffer);
  hci_le_setup_iso_data_path_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Data_Path_Direction = htob(Data_Path_Direction, 1);
  index_input += 1;
  cp0->Data_Path_ID = htob(Data_Path_ID, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Codec_ID, (const void *) Codec_ID, 5);
  index_input += 5;
  STM32WB_memcpy((void *) &cp0->Controller_Delay, (const void *) Controller_Delay, 3);
  index_input += 3;
  cp0->Codec_Configuration_Length = htob(Codec_Configuration_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Codec_Configuration, (const void *) Codec_Configuration, Codec_Configuration_Length*sizeof(uint8_t));
    index_input += Codec_Configuration_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06e;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_remove_iso_data_path(uint16_t Connection_Handle,
                                       uint8_t Data_Path_Direction)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_remove_iso_data_path_cp0 *cp0 = (hci_le_remove_iso_data_path_cp0*)(cmd_buffer);
  hci_le_remove_iso_data_path_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Data_Path_Direction = htob(Data_Path_Direction, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x06f;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_iso_transmit_test(uint16_t Connection_Handle,
                                    uint8_t Payload_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_iso_transmit_test_cp0 *cp0 = (hci_le_iso_transmit_test_cp0*)(cmd_buffer);
  hci_le_iso_transmit_test_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Payload_Type = htob(Payload_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x070;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_iso_receive_test(uint16_t Connection_Handle,
                                   uint8_t Payload_Type)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_iso_receive_test_cp0 *cp0 = (hci_le_iso_receive_test_cp0*)(cmd_buffer);
  hci_le_iso_receive_test_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Payload_Type = htob(Payload_Type, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x071;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_iso_read_test_counters(uint16_t Connection_Handle,
                                         uint32_t *Received_Packet_Count,
                                         uint32_t *Missed_Packet_Count,
                                         uint32_t *Failed_Packet_Count)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_iso_read_test_counters_cp0 *cp0 = (hci_le_iso_read_test_counters_cp0*)(cmd_buffer);
  hci_le_iso_read_test_counters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x072;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Received_Packet_Count = btoh(resp.Received_Packet_Count, 4);
  *Missed_Packet_Count = btoh(resp.Missed_Packet_Count, 4);
  *Failed_Packet_Count = btoh(resp.Failed_Packet_Count, 4);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_iso_test_end(uint16_t Connection_Handle,
                               uint32_t *Received_Packet_Count,
                               uint32_t *Missed_Packet_Count,
                               uint32_t *Failed_Packet_Count)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_iso_test_end_cp0 *cp0 = (hci_le_iso_test_end_cp0*)(cmd_buffer);
  hci_le_iso_test_end_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x073;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Received_Packet_Count = btoh(resp.Received_Packet_Count, 4);
  *Missed_Packet_Count = btoh(resp.Missed_Packet_Count, 4);
  *Failed_Packet_Count = btoh(resp.Failed_Packet_Count, 4);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_host_feature(uint8_t Bit_Number,
                                   uint8_t Bit_Value)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_host_feature_cp0 *cp0 = (hci_le_set_host_feature_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Bit_Number = htob(Bit_Number, 1);
  index_input += 1;
  cp0->Bit_Value = htob(Bit_Value, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x074;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_iso_link_quality(uint16_t Connection_Handle,
                                        uint32_t *Tx_UnACKed_Packets,
                                        uint32_t *Tx_Flushed_Packets,
                                        uint32_t *Tx_Last_Subevent_Packets,
                                        uint32_t *Retransmitted_Packets,
                                        uint32_t *CRC_Error_Packets,
                                        uint32_t *Rx_Unreceived_Packets,
                                        uint32_t *Duplicate_Packets)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_read_iso_link_quality_cp0 *cp0 = (hci_le_read_iso_link_quality_cp0*)(cmd_buffer);
  hci_le_read_iso_link_quality_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x075;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Tx_UnACKed_Packets = btoh(resp.Tx_UnACKed_Packets, 4);
  *Tx_Flushed_Packets = btoh(resp.Tx_Flushed_Packets, 4);
  *Tx_Last_Subevent_Packets = btoh(resp.Tx_Last_Subevent_Packets, 4);
  *Retransmitted_Packets = btoh(resp.Retransmitted_Packets, 4);
  *CRC_Error_Packets = btoh(resp.CRC_Error_Packets, 4);
  *Rx_Unreceived_Packets = btoh(resp.Rx_Unreceived_Packets, 4);
  *Duplicate_Packets = btoh(resp.Duplicate_Packets, 4);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_enhanced_read_transmit_power_level(uint16_t Connection_Handle,
                                                     uint8_t PHY,
                                                     int8_t *Current_Transmit_Power_Level,
                                                     int8_t *Max_Transmit_Power_Level)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_enhanced_read_transmit_power_level_cp0 *cp0 = (hci_le_enhanced_read_transmit_power_level_cp0*)(cmd_buffer);
  hci_le_enhanced_read_transmit_power_level_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x076;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Current_Transmit_Power_Level = btoh(resp.Current_Transmit_Power_Level, 1);
  *Max_Transmit_Power_Level = btoh(resp.Max_Transmit_Power_Level, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_read_remote_transmit_power_level(uint16_t Connection_Handle,
                                                   uint8_t PHY)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_read_remote_transmit_power_level_cp0 *cp0 = (hci_le_read_remote_transmit_power_level_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x077;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_path_loss_reporting_parameters(uint16_t Connection_Handle,
                                                     uint8_t High_Threshold,
                                                     uint8_t High_Hysteresis,
                                                     uint8_t Low_Threshold,
                                                     uint8_t Low_Hysteresis,
                                                     uint16_t Min_Time_Spent)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_path_loss_reporting_parameters_cp0 *cp0 = (hci_le_set_path_loss_reporting_parameters_cp0*)(cmd_buffer);
  hci_le_set_path_loss_reporting_parameters_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->High_Threshold = htob(High_Threshold, 1);
  index_input += 1;
  cp0->High_Hysteresis = htob(High_Hysteresis, 1);
  index_input += 1;
  cp0->Low_Threshold = htob(Low_Threshold, 1);
  index_input += 1;
  cp0->Low_Hysteresis = htob(Low_Hysteresis, 1);
  index_input += 1;
  cp0->Min_Time_Spent = htob(Min_Time_Spent, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x078;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_path_loss_reporting_enable(uint16_t Connection_Handle,
                                                 uint8_t Enable)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_path_loss_reporting_enable_cp0 *cp0 = (hci_le_set_path_loss_reporting_enable_cp0*)(cmd_buffer);
  hci_le_set_path_loss_reporting_enable_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Enable = htob(Enable, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x079;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_transmit_power_reporting_enable(uint16_t Connection_Handle,
                                                      uint8_t Local_Enable,
                                                      uint8_t Remote_Enable)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_transmit_power_reporting_enable_cp0 *cp0 = (hci_le_set_transmit_power_reporting_enable_cp0*)(cmd_buffer);
  hci_le_set_transmit_power_reporting_enable_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Local_Enable = htob(Local_Enable, 1);
  index_input += 1;
  cp0->Remote_Enable = htob(Remote_Enable, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07a;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_transmitter_test_v4(uint8_t TX_Channel,
                                      uint8_t Test_Data_Length,
                                      uint8_t Packet_Payload,
                                      uint8_t PHY,
                                      uint8_t CTE_Length,
                                      uint8_t CTE_Type,
                                      uint8_t Switching_Pattern_Length,
                                      uint8_t Antenna_IDs[],
                                      int8_t Transmit_Power_Level)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_transmitter_test_v4_cp0 *cp0 = (hci_le_transmitter_test_v4_cp0*)(cmd_buffer);
  hci_le_transmitter_test_v4_cp1 *cp1 = (hci_le_transmitter_test_v4_cp1*)(cmd_buffer + 1 + 1 + 1 + 1 + 1 + 1 + 1 + Switching_Pattern_Length * (sizeof(uint8_t)));
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->TX_Channel = htob(TX_Channel, 1);
  index_input += 1;
  cp0->Test_Data_Length = htob(Test_Data_Length, 1);
  index_input += 1;
  cp0->Packet_Payload = htob(Packet_Payload, 1);
  index_input += 1;
  cp0->PHY = htob(PHY, 1);
  index_input += 1;
  cp0->CTE_Length = htob(CTE_Length, 1);
  index_input += 1;
  cp0->CTE_Type = htob(CTE_Type, 1);
  index_input += 1;
  cp0->Switching_Pattern_Length = htob(Switching_Pattern_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Antenna_IDs, (const void *) Antenna_IDs, Switching_Pattern_Length*sizeof(uint8_t));
    index_input += Switching_Pattern_Length*sizeof(uint8_t);
    {
      cp1->Transmit_Power_Level = htob(Transmit_Power_Level, 1);
      index_input += 1;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07b;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_data_related_address_changes(uint8_t Advertising_Handle,
                                                   uint8_t Change_Reasons)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_data_related_address_changes_cp0 *cp0 = (hci_le_set_data_related_address_changes_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Change_Reasons = htob(Change_Reasons, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07c;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_default_subrate(uint16_t Subrate_Min,
                                      uint16_t Subrate_Max,
                                      uint16_t Max_Latency,
                                      uint16_t Continuation_Number,
                                      uint16_t Supervision_Timeout)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_default_subrate_cp0 *cp0 = (hci_le_set_default_subrate_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Subrate_Min = htob(Subrate_Min, 2);
  index_input += 2;
  cp0->Subrate_Max = htob(Subrate_Max, 2);
  index_input += 2;
  cp0->Max_Latency = htob(Max_Latency, 2);
  index_input += 2;
  cp0->Continuation_Number = htob(Continuation_Number, 2);
  index_input += 2;
  cp0->Supervision_Timeout = htob(Supervision_Timeout, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07d;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_subrate_request(uint16_t Connection_Handle,
                                  uint16_t Subrate_Min,
                                  uint16_t Subrate_Max,
                                  uint16_t Max_Latency,
                                  uint16_t Continuation_Number,
                                  uint16_t Supervision_Timeout)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_subrate_request_cp0 *cp0 = (hci_le_subrate_request_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->Subrate_Min = htob(Subrate_Min, 2);
  index_input += 2;
  cp0->Subrate_Max = htob(Subrate_Max, 2);
  index_input += 2;
  cp0->Max_Latency = htob(Max_Latency, 2);
  index_input += 2;
  cp0->Continuation_Number = htob(Continuation_Number, 2);
  index_input += 2;
  cp0->Supervision_Timeout = htob(Supervision_Timeout, 2);
  index_input += 2;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07e;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_extended_advertising_parameters_v2(uint8_t Advertising_Handle,
                                                         uint16_t Advertising_Event_Properties,
                                                         uint8_t Primary_Advertising_Interval_Min[3],
                                                         uint8_t Primary_Advertising_Interval_Max[3],
