sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/stm32wb05n_hci_le.c
                                                         uint8_t Primary_Advertising_Channel_Map,
                                                         uint8_t Own_Address_Type,
                                                         uint8_t Peer_Address_Type,
                                                         uint8_t Peer_Address[6],
                                                         uint8_t Advertising_Filter_Policy,
                                                         int8_t Advertising_Tx_Power,
                                                         uint8_t Primary_Advertising_PHY,
                                                         uint8_t Secondary_Advertising_Max_Skip,
                                                         uint8_t Secondary_Advertising_PHY,
                                                         uint8_t Advertising_SID,
                                                         uint8_t Scan_Request_Notification_Enable,
                                                         uint8_t Primary_Advertising_PHY_Options,
                                                         uint8_t Secondary_Advertising_PHY_Options,
                                                         int8_t *Selected_Tx_Power)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_extended_advertising_parameters_v2_cp0 *cp0 = (hci_le_set_extended_advertising_parameters_v2_cp0*)(cmd_buffer);
  hci_le_set_extended_advertising_parameters_v2_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Advertising_Event_Properties = htob(Advertising_Event_Properties, 2);
  index_input += 2;
  STM32WB_memcpy((void *) &cp0->Primary_Advertising_Interval_Min, (const void *) Primary_Advertising_Interval_Min, 3);
  index_input += 3;
  STM32WB_memcpy((void *) &cp0->Primary_Advertising_Interval_Max, (const void *) Primary_Advertising_Interval_Max, 3);
  index_input += 3;
  cp0->Primary_Advertising_Channel_Map = htob(Primary_Advertising_Channel_Map, 1);
  index_input += 1;
  cp0->Own_Address_Type = htob(Own_Address_Type, 1);
  index_input += 1;
  cp0->Peer_Address_Type = htob(Peer_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Address, (const void *) Peer_Address, 6);
  index_input += 6;
  cp0->Advertising_Filter_Policy = htob(Advertising_Filter_Policy, 1);
  index_input += 1;
  cp0->Advertising_Tx_Power = htob(Advertising_Tx_Power, 1);
  index_input += 1;
  cp0->Primary_Advertising_PHY = htob(Primary_Advertising_PHY, 1);
  index_input += 1;
  cp0->Secondary_Advertising_Max_Skip = htob(Secondary_Advertising_Max_Skip, 1);
  index_input += 1;
  cp0->Secondary_Advertising_PHY = htob(Secondary_Advertising_PHY, 1);
  index_input += 1;
  cp0->Advertising_SID = htob(Advertising_SID, 1);
  index_input += 1;
  cp0->Scan_Request_Notification_Enable = htob(Scan_Request_Notification_Enable, 1);
  index_input += 1;
  cp0->Primary_Advertising_PHY_Options = htob(Primary_Advertising_PHY_Options, 1);
  index_input += 1;
  cp0->Secondary_Advertising_PHY_Options = htob(Secondary_Advertising_PHY_Options, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x07f;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  *Selected_Tx_Power = btoh(resp.Selected_Tx_Power, 1);
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_advertising_subevent_data(uint8_t Advertising_Handle,
                                                         uint8_t Num_Subevents,
                                                         Subevent_Data_Parameters_t Subevent_Data_Parameters[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_subevent_data_cp0 *cp0 = (hci_le_set_periodic_advertising_subevent_data_cp0*)(cmd_buffer);
  hci_le_set_periodic_advertising_subevent_data_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Num_Subevents = htob(Num_Subevents, 1);
  index_input += 1;
  /* var_len_data input */
  {
    for (int i = 0; i < Num_Subevents; i++) {
      packed_Subevent_Data_Parameters_t *Subevent_Data_Parameters_tmp = (packed_Subevent_Data_Parameters_t *)(((uint8_t *)cmd_buffer) + index_input);
      Subevent_Data_Parameters_tmp->Subevent = Subevent_Data_Parameters[i].Subevent;
      index_input += 1;
      Subevent_Data_Parameters_tmp->Response_Slot_Start = Subevent_Data_Parameters[i].Response_Slot_Start;
      index_input += 1;
      Subevent_Data_Parameters_tmp->Response_Slot_Count = Subevent_Data_Parameters[i].Response_Slot_Count;
      index_input += 1;
      Subevent_Data_Parameters_tmp->Subevent_Data_Length = Subevent_Data_Parameters[i].Subevent_Data_Length;
      index_input += 1;
      STM32WB_memcpy(Subevent_Data_Parameters_tmp->Subevent_Data, Subevent_Data_Parameters[i].Subevent_Data, Subevent_Data_Parameters[i].Subevent_Data_Length);
      index_input += Subevent_Data_Parameters[i].Subevent_Data_Length;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x082;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_advertising_response_data(uint16_t Sync_Handle,
                                                         uint16_t Request_Event,
                                                         uint8_t Request_Subevent,
                                                         uint8_t Response_Subevent,
                                                         uint8_t Response_Slot,
                                                         uint8_t Response_Data_Length,
                                                         uint8_t Response_Data[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_response_data_cp0 *cp0 = (hci_le_set_periodic_advertising_response_data_cp0*)(cmd_buffer);
  hci_le_set_periodic_advertising_response_data_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  cp0->Request_Event = htob(Request_Event, 2);
  index_input += 2;
  cp0->Request_Subevent = htob(Request_Subevent, 1);
  index_input += 1;
  cp0->Response_Subevent = htob(Response_Subevent, 1);
  index_input += 1;
  cp0->Response_Slot = htob(Response_Slot, 1);
  index_input += 1;
  cp0->Response_Data_Length = htob(Response_Data_Length, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Response_Data, (const void *) Response_Data, Response_Data_Length*sizeof(uint8_t));
    index_input += Response_Data_Length*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x083;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_sync_subevent(uint16_t Sync_Handle,
                                             uint16_t Periodic_Advertising_Properties,
                                             uint8_t Num_Subevents,
                                             uint8_t Subevent[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_sync_subevent_cp0 *cp0 = (hci_le_set_periodic_sync_subevent_cp0*)(cmd_buffer);
  hci_le_set_periodic_sync_subevent_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Sync_Handle = htob(Sync_Handle, 2);
  index_input += 2;
  cp0->Periodic_Advertising_Properties = htob(Periodic_Advertising_Properties, 2);
  index_input += 2;
  cp0->Num_Subevents = htob(Num_Subevents, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Subevent, (const void *) Subevent, Num_Subevents*sizeof(uint8_t));
    index_input += Num_Subevents*sizeof(uint8_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x084;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_extended_create_connection_v2(uint8_t Advertising_Handle,
                                                uint8_t Subevent,
                                                uint8_t Initiator_Filter_Policy,
                                                uint8_t Own_Address_Type,
                                                uint8_t Peer_Address_Type,
                                                uint8_t Peer_Address[6],
                                                uint8_t Initiating_PHYs,
                                                Extended_Create_Connection_Parameters_t Extended_Create_Connection_Parameters[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_extended_create_connection_v2_cp0 *cp0 = (hci_le_extended_create_connection_v2_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Subevent = htob(Subevent, 1);
  index_input += 1;
  cp0->Initiator_Filter_Policy = htob(Initiator_Filter_Policy, 1);
  index_input += 1;
  cp0->Own_Address_Type = htob(Own_Address_Type, 1);
  index_input += 1;
  cp0->Peer_Address_Type = htob(Peer_Address_Type, 1);
  index_input += 1;
  STM32WB_memcpy((void *) &cp0->Peer_Address, (const void *) Peer_Address, 6);
  index_input += 6;
  cp0->Initiating_PHYs = htob(Initiating_PHYs, 1);
  index_input += 1;
  int len = 0;

  for (int i = 0; i < sizeof( cp0->Initiating_PHYs)*8; i++) {
    if((cp0->Initiating_PHYs >> i) & 0x01){
      len++;
    }
  }
  /* var_len_data input */
  {
    for (int i = 0; i < len; i++) {
      packed_Extended_Create_Connection_Parameters_t *Extended_Create_Connection_Parameters_tmp = (packed_Extended_Create_Connection_Parameters_t *)(((uint8_t *)cmd_buffer) + index_input);
      Extended_Create_Connection_Parameters_tmp->Scan_Interval = Extended_Create_Connection_Parameters[i].Scan_Interval;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Scan_Window = Extended_Create_Connection_Parameters[i].Scan_Window;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Connection_Interval_Min = Extended_Create_Connection_Parameters[i].Connection_Interval_Min;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Connection_Interval_Max = Extended_Create_Connection_Parameters[i].Connection_Interval_Max;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Max_Latency = Extended_Create_Connection_Parameters[i].Max_Latency;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Supervision_Timeout = Extended_Create_Connection_Parameters[i].Supervision_Timeout;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Min_CE_Length = Extended_Create_Connection_Parameters[i].Min_CE_Length;
      index_input += 2;
      Extended_Create_Connection_Parameters_tmp->Max_CE_Length = Extended_Create_Connection_Parameters[i].Max_CE_Length;
      index_input += 2;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x085;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus hci_le_set_periodic_advertising_parameters_v2(uint8_t Advertising_Handle,
                                                         uint16_t Periodic_Advertising_Interval_Min,
                                                         uint16_t Periodic_Advertising_Interval_Max,
                                                         uint16_t Periodic_Advertising_Properties,
                                                         uint8_t Num_Subevents,
                                                         uint8_t Subevent_Interval,
                                                         uint8_t Response_Slot_Delay,
                                                         uint8_t Response_Slot_Spacing,
                                                         uint8_t Num_Response_Slots)
{
  struct hci_request rq;
  uint8_t cmd_buffer[258];
  hci_le_set_periodic_advertising_parameters_v2_cp0 *cp0 = (hci_le_set_periodic_advertising_parameters_v2_cp0*)(cmd_buffer);
  hci_le_set_periodic_advertising_parameters_v2_rp0 resp;
  STM32WB_memset(&resp, 0, sizeof(resp));
  uint8_t index_input = 0;
  cp0->Advertising_Handle = htob(Advertising_Handle, 1);
  index_input += 1;
  cp0->Periodic_Advertising_Interval_Min = htob(Periodic_Advertising_Interval_Min, 2);
  index_input += 2;
  cp0->Periodic_Advertising_Interval_Max = htob(Periodic_Advertising_Interval_Max, 2);
  index_input += 2;
  cp0->Periodic_Advertising_Properties = htob(Periodic_Advertising_Properties, 2);
  index_input += 2;
  cp0->Num_Subevents = htob(Num_Subevents, 1);
  index_input += 1;
  cp0->Subevent_Interval = htob(Subevent_Interval, 1);
  index_input += 1;
  cp0->Response_Slot_Delay = htob(Response_Slot_Delay, 1);
  index_input += 1;
  cp0->Response_Slot_Spacing = htob(Response_Slot_Spacing, 1);
  index_input += 1;
  cp0->Num_Response_Slots = htob(Num_Response_Slots, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ogf = 0x08;
  rq.ocf = 0x086;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &resp;
  rq.rlen = sizeof(resp);
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (resp.Status) {
    return resp.Status;
  }
  return BLE_STATUS_SUCCESS;
}
